Documents/упОтчетИнкассатора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упОтчетИнкассатора</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упИнкассацияДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаПеревозкуГруза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/упОтчетИнкассатора/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Нет.
	
#КонецОбласти

#Область ПроцедурыФункцииПечати

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
  // Отчет инкассатора
  КомандаПечати = КомандыПечати.Добавить();
  КомандаПечати.МенеджерПечати = "Документ.упОтчетИнкассатора";
  КомандаПечати.Идентификатор = "ОтчетИнкассатора";
  КомандаПечати.Представление = НСтр("ru = 'Отчет инкассатора'");
  КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
  КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//            представление - имя области в которой был выведен объект (выходной параметр).
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОтчетИнкассатора") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ОтчетИнкассатора",
		НСтр("ru = 'Отчет инкассатора'"),
		ПечатьОтчетИнкассатора(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.упОтчетИнкассатора.ПФ_MXL_ОтчетИнкассатора");
	КонецЕсли;
КонецПроцедуры

// Формирование печатной формы Форма3
//
// Параметры:
//  МассивОбъектов  - Массив - Объекты.
//  ОбъектыПечати  - Произвольный - Объект Печати.
//  ПараметрыПечати  - Структура - Параметры.
//
// Возвращаемое значение:
//   ТабличныйДокумент - Результат выполнения.
//
Функция ПечатьОтчетИнкассатора(МассивОбъектов, ОбъектыПечати, ПараметрыПечати = Неопределено) Экспорт
	ЭтоРейс = ПараметрыПечати <> Неопределено И ПараметрыПечати.Свойство("ЭтоРейс");
	
	УстановитьПривилегированныйРежим(Истина);	
	ТабличныйДокумент	= Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ПолеСверху			= 0;
	ТабличныйДокумент.ПолеСлева				= 0;
	ТабличныйДокумент.ПолеСнизу				= 0;
	ТабличныйДокумент.ПолеСправа			= 0;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати 	= "ПараметрыПечати_упОтчетИнкассатора_ОтчетИнкассатора";
	дрвОтчетыИнкассатора = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов, ЭтоРейс);
	ЗаполнитьТабличныйДокументОтчетИнкассатора(ТабличныйДокумент, дрвОтчетыИнкассатора, ОбъектыПечати);
    
  	Возврат ТабличныйДокумент;
КонецФункции

Процедура ЗаполнитьТабличныйДокументОтчетИнкассатора(ТабличныйДокумент, дрвОтчетыИнкассатора, ОбъектыПечати)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.упОтчетИнкассатора.ПФ_MXL_ОтчетИнкассатора");
	
	ТекущаяДатаПечати = ТекущаяДатаСеанса();
		
    ЭтоПервыйРейс		= Истина;
	
	Для каждого текСтрокаРейс Из дрвОтчетыИнкассатора.Строки Цикл
		
		Для каждого текСтрокаСотрудник Из текСтрокаРейс.Строки Цикл
			
			СчетчикКвитанций 	= 0;
			
			Если НЕ ЭтоПервыйРейс Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервыйРейс = Ложь;
			
			мсвПолучатели = Новый Массив;
			
			Для каждого текСтрока Из текСтрокаСотрудник.Строки Цикл
				
				ОбластьТаблица		= Макет.ПолучитьОбласть("Таблица");
				ОбластьТаблица.Параметры.Заполнить(текСтрока);
				ОбластьТаблица.Параметры.ТекущаяДатаПечати =  ТекущаяДатаПечати;
				ТабличныйДокумент.Вывести(ОбластьТаблица);
				
				СчетчикКвитанций = СчетчикКвитанций + 1;
				
				Если СчетчикКвитанций = 3 Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					СчетчикКвитанций = 0;
				КонецЕсли;
								
			КонецЦикла;
			
			ОбластьИтогШапка		= Макет.ПолучитьОбласть("ИтогШапка");
			ОбластьИтогШапка.Параметры.Заполнить(текСтрокаСотрудник);
			ТабличныйДокумент.Вывести(ОбластьИтогШапка);
			
			ОбластьИтогСтрока		= Макет.ПолучитьОбласть("ИтогСтрока");
			
			мсвПолучателей = текСтрокаСотрудник.ЗаявкаНаПеревозкуГрузаПолучательСписок;
			Для каждого текСтрокаПолучатель Из мсвПолучателей Цикл
				ОбластьИтогСтрока.Параметры.ЗаявкаНаПеревозкуГрузаПолучатель = текСтрокаПолучатель;
				ТабличныйДокумент.Вывести(ОбластьИтогСтрока);
			КонецЦикла;
			
			ОбластьИтогПодвал		= Макет.ПолучитьОбласть("ИтогПодвал");
			ОбластьИтогПодвал.Параметры.Заполнить(текСтрокаСотрудник);
			ТабличныйДокумент.Вывести(ОбластьИтогПодвал);
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, текСтрокаСотрудник.Рейс);	

		КонецЦикла;
		
	КонецЦикла;
		
	
КонецПроцедуры

// Возвращает таблицу документов "упОтчетИнкассатора".
//
// Параметры:
//  МассивОбъектов  - Массив - Объекты.
//  ЭтоРейс  - Булево - Флаг рейса.
//
// Возвращаемое значение:
//   ТаблицаЗначений - Результат выполнения.
//
Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов, ЭтоРейс = Ложь) Экспорт
	
	тзОтчетыИнкассатора = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	упОтчетИнкассатора.ЗаявкаНаПеревозкуГруза.КонтактноеЛицоПолучателя КАК КонтактноеЛицоПолучателя,
	               |	упОтчетИнкассатора.ЗаявкаНаПеревозкуГруза.Получатель,
	               |	упОтчетИнкассатора.ЗаявкаНаПеревозкуГруза.ДатаКИС,
	               |	упОтчетИнкассатора.ЗаявкаНаПеревозкуГруза.НомерКИС,
	               |	упОтчетИнкассатора.Сотрудник КАК Сотрудник,
	               |	упОтчетИнкассатора.ЗаявкаНаПеревозкуГруза.СуммаИнкассацииПлан,
	               |	упОтчетИнкассатора.ЗаявкаНаПеревозкуГруза.АдресПолучения,
	               |	упОтчетИнкассатора.Организация.НаименованиеПолное КАК Организация,
	               |	упОтчетИнкассатора.Ссылка,
	               |	упОтчетИнкассатора.Рейс.Номер КАК РейсНомер,
	               |	упОтчетИнкассатора.Рейс.Дата КАК РейсДата,
	               |	упОтчетИнкассатора.Рейс КАК Рейс
	               |ИЗ
	               |	Документ.упОтчетИнкассатора КАК упОтчетИнкассатора
	               |ГДЕ
	               |	упОтчетИнкассатора.Проведен
	               |	И НЕ упОтчетИнкассатора.ПометкаУдаления
	               |ИТОГИ
	               |	МАКСИМУМ(РейсНомер),
	               |	МАКСИМУМ(РейсДата)
	               |ПО
	               |	Рейс,
	               |	Сотрудник";
					   
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов;
	ЗапросОтчетыИнкассатора = ПакетЗапросов[0];
	
	Отбор = ЗапросОтчетыИнкассатора.Операторы[0].Отбор;
	
	Если ЭтоРейс Тогда
		Отбор.Добавить("упОтчетИнкассатора.Рейс В(&мсвОбъектов)");		
	Иначе	
		Отбор.Добавить("упОтчетИнкассатора.Ссылка В(&мсвОбъектов)");			
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("мсвОбъектов", МассивОбъектов);
	
	дрвДанные	= Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);

	дрвОтчетыИнкассатора = дрвДанные.Скопировать();
	дрвОтчетыИнкассатора.Колонки.Добавить("ЗаявкаНаПеревозкуГрузаКонтактноеЛицоПолучателя", Новый ОписаниеТипов("Строка"));
	дрвОтчетыИнкассатора.Колонки.Добавить("РейсДатаСтрока", Новый ОписаниеТипов("Строка"));
	дрвОтчетыИнкассатора.Колонки.Добавить("ЗаявкаНаПеревозкуГрузаДатаКИССтрока", Новый ОписаниеТипов("Строка"));
	дрвОтчетыИнкассатора.Колонки.Добавить("ЗаявкаНаПеревозкуГрузаПолучательСписок", Новый ОписаниеТипов("Массив"));
	
	Для каждого текСтрокаРейс Из дрвОтчетыИнкассатора.Строки Цикл
		
		Для каждого текСтрокаСотрудник Из текСтрокаРейс.Строки Цикл
			
			мсвПолучатели = Новый Массив;
			
			Для каждого текСтрока Из текСтрокаСотрудник.Строки Цикл
				
				мсвПолучатели.Добавить(текСтрока.ЗаявкаНаПеревозкуГрузаПолучатель);
				
				СтрокаКонтактноеЛицо = "" + текСтрока.КонтактноеЛицоПолучателя;
				Если ЗначениеЗаполнено(СтрокаКонтактноеЛицо) Тогда
					Телефон							= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(текСтрока.КонтактноеЛицоПолучателя, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица);
					МобильныйТелефон				= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(текСтрока.КонтактноеЛицоПолучателя, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица);
					Если ЗначениеЗаполнено(Телефон) Тогда
						СтрокаКонтактноеЛицо = СтрокаКонтактноеЛицо + ?(СтрДлина(СтрокаКонтактноеЛицо) > 0, ", ","") + Телефон;		
					КонецЕсли;
					Если ЗначениеЗаполнено(МобильныйТелефон) Тогда
						СтрокаКонтактноеЛицо = СтрокаКонтактноеЛицо + ?(СтрДлина(СтрокаКонтактноеЛицо) > 0, ", ","") + МобильныйТелефон;		
					КонецЕсли;
				КонецЕсли;
				
				текСтрока.ЗаявкаНаПеревозкуГрузаКонтактноеЛицоПолучателя = СтрокаКонтактноеЛицо; 

			КонецЦикла;

			текСтрокаСотрудник.РейсДатаСтрока = Формат(текСтрока.РейсДата, "ДФ=dd.MM.yyyy");
			текСтрокаСотрудник.ЗаявкаНаПеревозкуГрузаПолучательСписок = мсвПолучатели;
			
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат дрвОтчетыИнкассатора;
	
КонецФункции

#КонецОбласти

#КонецЕсли
